betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rng.c
/** @addtogroup RNG_Exported_Functions
  * @{
  */

/** @addtogroup RNG_Exported_Functions_Group1
  *  @brief   Initialization and configuration functions
  *
@verbatim
 ===============================================================================
          ##### Initialization and configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Initialize the RNG according to the specified parameters
          in the RNG_InitTypeDef and create the associated handle
      (+) DeInitialize the RNG peripheral
      (+) Initialize the RNG MSP
      (+) DeInitialize RNG MSP

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the RNG peripheral and creates the associated handle.
  * @param  hrng pointer to a RNG_HandleTypeDef structure that contains
  *                the configuration information for RNG.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_Init(RNG_HandleTypeDef *hrng)
{
  /* Check the RNG handle allocation */
  if (hrng == NULL)
  {
    return DAL_ERROR;
  }
  /* Check the parameters */
  ASSERT_PARAM(IS_RNG_ALL_INSTANCE(hrng->Instance));

#if (USE_DAL_RNG_REGISTER_CALLBACKS == 1)
  if (hrng->State == DAL_RNG_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hrng->Lock = DAL_UNLOCKED;

    hrng->ReadyDataCallback  = DAL_RNG_ReadyDataCallback;  /* Legacy weak ReadyDataCallback  */
    hrng->ErrorCallback      = DAL_RNG_ErrorCallback;      /* Legacy weak ErrorCallback      */

    if (hrng->MspInitCallback == NULL)
    {
      hrng->MspInitCallback = DAL_RNG_MspInit; /* Legacy weak MspInit  */
    }

    /* Init the low level hardware */
    hrng->MspInitCallback(hrng);
  }
#else
  if (hrng->State == DAL_RNG_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hrng->Lock = DAL_UNLOCKED;

    /* Init the low level hardware */
    DAL_RNG_MspInit(hrng);
  }
#endif /* USE_DAL_RNG_REGISTER_CALLBACKS */

  /* Change RNG peripheral state */
  hrng->State = DAL_RNG_STATE_BUSY;


  /* Enable the RNG Peripheral */
  __DAL_RNG_ENABLE(hrng);

  /* Initialize the RNG state */
  hrng->State = DAL_RNG_STATE_READY;

  /* Initialise the error code */
  hrng->ErrorCode = DAL_RNG_ERROR_NONE;

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  DeInitializes the RNG peripheral.
  * @param  hrng pointer to a RNG_HandleTypeDef structure that contains
  *                the configuration information for RNG.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_DeInit(RNG_HandleTypeDef *hrng)
{
  /* Check the RNG handle allocation */
  if (hrng == NULL)
  {
    return DAL_ERROR;
  }

  /* Disable the RNG Peripheral */
  CLEAR_BIT(hrng->Instance->CTRL, RNG_CTRL_INTEN | RNG_CTRL_RNGEN);

  /* Clear RNG interrupt status flags */
  CLEAR_BIT(hrng->Instance->STS, RNG_STS_CLKERINT | RNG_STS_FSINT);

#if (USE_DAL_RNG_REGISTER_CALLBACKS == 1)
  if (hrng->MspDeInitCallback == NULL)
  {
    hrng->MspDeInitCallback = DAL_RNG_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware */
  hrng->MspDeInitCallback(hrng);
#else
  /* DeInit the low level hardware */
  DAL_RNG_MspDeInit(hrng);
#endif /* USE_DAL_RNG_REGISTER_CALLBACKS */

  /* Update the RNG state */
  hrng->State = DAL_RNG_STATE_RESET;

  /* Initialise the error code */
  hrng->ErrorCode = DAL_RNG_ERROR_NONE;

  /* Release Lock */
  __DAL_UNLOCK(hrng);

  /* Return the function status */
  return DAL_OK;
}

/**
  * @brief  Initializes the RNG MSP.
  * @param  hrng pointer to a RNG_HandleTypeDef structure that contains
  *                the configuration information for RNG.
  * @retval None
  */
__weak void DAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrng);
  /* NOTE : This function should not be modified. When the callback is needed,
            function DAL_RNG_MspInit must be implemented in the user file.
   */
}

/**
  * @brief  DeInitializes the RNG MSP.
  * @param  hrng pointer to a RNG_HandleTypeDef structure that contains
  *                the configuration information for RNG.
  * @retval None
  */
__weak void DAL_RNG_MspDeInit(RNG_HandleTypeDef *hrng)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrng);
  /* NOTE : This function should not be modified. When the callback is needed,
            function DAL_RNG_MspDeInit must be implemented in the user file.
   */
}

#if (USE_DAL_RNG_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User RNG Callback
  *         To be used instead of the weak predefined callback
  * @param  hrng RNG handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_RNG_ERROR_CB_ID Error callback ID
  *          @arg @ref DAL_RNG_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref DAL_RNG_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_RegisterCallback(RNG_HandleTypeDef *hrng, DAL_RNG_CallbackIDTypeDef CallbackID,
                                           pRNG_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hrng);

  if (DAL_RNG_STATE_READY == hrng->State)
  {
    switch (CallbackID)
    {
      case DAL_RNG_ERROR_CB_ID :
        hrng->ErrorCallback = pCallback;
        break;

      case DAL_RNG_MSPINIT_CB_ID :
        hrng->MspInitCallback = pCallback;
        break;

      case DAL_RNG_MSPDEINIT_CB_ID :
        hrng->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_RNG_STATE_RESET == hrng->State)
  {
    switch (CallbackID)
    {
      case DAL_RNG_MSPINIT_CB_ID :
        hrng->MspInitCallback = pCallback;
        break;

