betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rng.c
      case DAL_RNG_MSPDEINIT_CB_ID :
        hrng->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrng);
  return status;
}

/**
  * @brief  Unregister an RNG Callback
  *         RNG callback is redirected to the weak predefined callback
  * @param  hrng RNG handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_RNG_ERROR_CB_ID Error callback ID
  *          @arg @ref DAL_RNG_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref DAL_RNG_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_UnRegisterCallback(RNG_HandleTypeDef *hrng, DAL_RNG_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hrng);

  if (DAL_RNG_STATE_READY == hrng->State)
  {
    switch (CallbackID)
    {
      case DAL_RNG_ERROR_CB_ID :
        hrng->ErrorCallback = DAL_RNG_ErrorCallback;          /* Legacy weak ErrorCallback  */
        break;

      case DAL_RNG_MSPINIT_CB_ID :
        hrng->MspInitCallback = DAL_RNG_MspInit;              /* Legacy weak MspInit  */
        break;

      case DAL_RNG_MSPDEINIT_CB_ID :
        hrng->MspDeInitCallback = DAL_RNG_MspDeInit;          /* Legacy weak MspDeInit  */
        break;

      default :
        /* Update the error code */
        hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_RNG_STATE_RESET == hrng->State)
  {
    switch (CallbackID)
    {
      case DAL_RNG_MSPINIT_CB_ID :
        hrng->MspInitCallback = DAL_RNG_MspInit;              /* Legacy weak MspInit  */
        break;

      case DAL_RNG_MSPDEINIT_CB_ID :
        hrng->MspDeInitCallback = DAL_RNG_MspDeInit;          /* Legacy weak MspInit  */
        break;

      default :
        /* Update the error code */
        hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrng);
  return status;
}

/**
  * @brief  Register Data Ready RNG Callback
  *         To be used instead of the weak DAL_RNG_ReadyDataCallback() predefined callback
  * @param  hrng RNG handle
  * @param  pCallback pointer to the Data Ready Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_RegisterReadyDataCallback(RNG_HandleTypeDef *hrng, pRNG_ReadyDataCallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hrng);

  if (DAL_RNG_STATE_READY == hrng->State)
  {
    hrng->ReadyDataCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrng);
  return status;
}

/**
  * @brief  UnRegister the Data Ready RNG Callback
  *         Data Ready RNG Callback is redirected to the weak DAL_RNG_ReadyDataCallback() predefined callback
  * @param  hrng RNG handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RNG_UnRegisterReadyDataCallback(RNG_HandleTypeDef *hrng)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hrng);

  if (DAL_RNG_STATE_READY == hrng->State)
  {
    hrng->ReadyDataCallback = DAL_RNG_ReadyDataCallback; /* Legacy weak ReadyDataCallback  */
  }
  else
  {
    /* Update the error code */
    hrng->ErrorCode = DAL_RNG_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrng);
  return status;
}

#endif /* USE_DAL_RNG_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group2
  *  @brief   Peripheral Control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Get the 32 bit Random number
      (+) Get the 32 bit Random number with interrupt enabled
      (+) Handle RNG interrupt request

@endverbatim
  * @{
  */

/**
  * @brief  Generates a 32-bit random number.
  * @note   Each time the random number data is read the RNG_FLAG_DRDY flag
  *         is automatically cleared.
  * @param  hrng pointer to a RNG_HandleTypeDef structure that contains
  *                the configuration information for RNG.
  * @param  random32bit pointer to generated random number variable if successful.
  * @retval DAL status
  */

DAL_StatusTypeDef DAL_RNG_GenerateRandomNumber(RNG_HandleTypeDef *hrng, uint32_t *random32bit)
{
  uint32_t tickstart;
  DAL_StatusTypeDef status = DAL_OK;

  /* Process Locked */
  __DAL_LOCK(hrng);

  /* Check RNG peripheral state */
  if (hrng->State == DAL_RNG_STATE_READY)
  {
    /* Change RNG peripheral state */
    hrng->State = DAL_RNG_STATE_BUSY;

    /* Get tick */
    tickstart = DAL_GetTick();

    /* Check if data register contains valid random data */
    while (__DAL_RNG_GET_FLAG(hrng, RNG_FLAG_DRDY) == RESET)
    {
      if ((DAL_GetTick() - tickstart) > RNG_TIMEOUT_VALUE)
      {
        /* New check to avoid false timeout detection in case of preemption */
        if (__DAL_RNG_GET_FLAG(hrng, RNG_FLAG_DRDY) == RESET)
        {
          hrng->State = DAL_RNG_STATE_READY;
          hrng->ErrorCode = DAL_RNG_ERROR_TIMEOUT;
          /* Process Unlocked */
          __DAL_UNLOCK(hrng);
          return DAL_ERROR;
        }
      }
    }

    /* Get a 32bit Random number */
    hrng->RandomNumber = hrng->Instance->DATA;
    *random32bit = hrng->RandomNumber;

    hrng->State = DAL_RNG_STATE_READY;
  }
  else
  {
    hrng->ErrorCode = DAL_RNG_ERROR_BUSY;
    status = DAL_ERROR;
  }

  /* Process Unlocked */
  __DAL_UNLOCK(hrng);

